# Ex3 - Getting and Knowing your Data



### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset

In [2]:
pd.read_csv("C:/Users/raghu/Downloads/csv_file/users_data (1).csv")

,user_id,age,gender,occupation,zip_code
0,1,24.0,M,technician,85711.0
1,2,53.0,F,other,94043.0
2,3,23.0,M,writer,32067.0
3,4,24.0,M,technician,43537.0
4,5,33.0,F,other,15213.0
5,6,42.0,M,executive,98101.0
6,7,57.0,M,administrator,91344.0
7,8,36.0,M,administrator,5201.0
8,9,29.0,M,student,1002.0
9,10,53.0,M,lawyer,90703.0
10,... (truncated for brevity; assuming full data...,NaN,NaN,NaN,NaN
11,500,28.0,M,administrator,94305.0

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [19]:
users = pd.read_csv("C:/Users/raghu/Downloads/csv_file/users_data (1).csv") 
users

,user_id,age,gender,occupation,zip_code
0,1,24.0,M,technician,85711.0
1,2,53.0,F,other,94043.0
2,3,23.0,M,writer,32067.0
3,4,24.0,M,technician,43537.0
4,5,33.0,F,other,15213.0
5,6,42.0,M,executive,98101.0
6,7,57.0,M,administrator,91344.0
7,8,36.0,M,administrator,5201.0
8,9,29.0,M,student,1002.0
9,10,53.0,M,lawyer,90703.0
10,... (truncated for brevity; assuming full data...,NaN,NaN,NaN,NaN
11,500,28.0,M,administrator,94305.0

### Step 4. See the first 25 entries

In [4]:
users.head(25)

,user_id,age,gender,occupation,zip_code
0,1,24.0,M,technician,85711.0
1,2,53.0,F,other,94043.0
2,3,23.0,M,writer,32067.0
3,4,24.0,M,technician,43537.0
4,5,33.0,F,other,15213.0
5,6,42.0,M,executive,98101.0
6,7,57.0,M,administrator,91344.0
7,8,36.0,M,administrator,5201.0
8,9,29.0,M,student,1002.0
9,10,53.0,M,lawyer,90703.0
10,... (truncated for brevity; assuming full data...,NaN,NaN,NaN,NaN
11,500,28.0,M,administrator,94305.0

### Step 5. See the last 10 entries

### Step 6. What is the number of observations in the dataset?

In [20]:
users.shape[0]

12

### Step 7. What is the number of columns in the dataset?

In [21]:
users.shape[1]

5

### Step 8. Print the name of all the columns.

In [22]:
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [23]:
users.index 
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     12 non-null     object
 1   age         11 non-null     float64
 2   gender      11 non-null     object
 3   occupation  11 non-null     object
 4   zip_code    11 non-null     float64
dtypes: float64(2), object(3)
memory usage: 612.0+ bytes

### Step 10. What is the data type of each column?

In [24]:
users.dtypes

user_id        object
age           float64
gender         object
occupation     object
zip_code      float64
dtype: object

### Step 11. Print only the occupation column

In [25]:
users.occupation

0        technician
1             other
2            writer
3        technician
4             other
5         executive
6     administrator
7     administrator
8           student
9            lawyer
10              NaN
11    administrator
Name: occupation, dtype: object

In [16]:
user_id["occupation"]

0        technician
1             other
2            writer
3        technician
4             other
5         executive
6     administrator
7     administrator
8           student
9            lawyer
10              NaN
11    administrator
Name: occupation, dtype: object

### Step 12. How many different occupations are in this dataset?

In [26]:
users.occupation.nunique()

7

In [44]:
#user.users_id.unique

### Step 13. What is the most frequent occupation?

### Step 14. Summarize the DataFrame.

In [33]:
users.describe()

             age      zip_code
count  11.000000     11.000000
mean   36.545455  59202.454545
std    12.769993  39884.178451
min    23.000000   1002.000000
25%    26.000000  23640.000000
50%    33.000000  85711.000000
75%    47.500000  92693.500000
max    57.000000  98101.000000

### Step 15. Summarize all the columns

In [34]:
users.describe(include = 'all')

       user_id        age gender     occupation      zip_code
count       12  11.000000     11             11     11.000000
unique      12        NaN      2              7           NaN
top          1        NaN      M  administrator           NaN
freq         1        NaN      9              3           NaN
mean       NaN  36.545455    NaN            NaN  59202.454545
std        NaN  12.769993    NaN            NaN  39884.178451
min        NaN  23.000000    NaN            NaN   1002.000000
25%        NaN  26.000000    NaN            NaN  23640.000000
50%        NaN  33.000000    NaN            NaN  85711.000000
75%        NaN  47.500000    NaN            NaN  92693.500000
max        NaN  57.000000    NaN            NaN  98101.000000

### Step 16. Summarize only the occupation column

In [36]:
users.occupation.describe()

count                11
unique                7
top       administrator
freq                  3
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [43]:
users.age.mean()

36.54545454545455

round(users.age.mean())

### Step 18. What is the age with least occurrence?

In [39]:
users.age.value_counts()

age
24.0    2
53.0    2
23.0    1
33.0    1
42.0    1
57.0    1
36.0    1
29.0    1
28.0    1
Name: count, dtype: int64

In [41]:
users.age.value_counts().tail() # .tail for least occurence

age
42.0    1
57.0    1
36.0    1
29.0    1
28.0    1
Name: count, dtype: int64